<a href="https://colab.research.google.com/github/Homedepot5/DataScience/blob/deeplearning/Bank_Customer_Chunk.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [42]:
import pandas as pd
from matplotlib import pyplot as plt
import numpy as np
%matplotlib inline

In [44]:
df = pd.read_csv("Bank_Churn_Modelling.csv")
df.head(5)

   RowNumber  CustomerId   Surname  ...  IsActiveMember EstimatedSalary Exited
0          1    15634602  Hargrave  ...               1       101348.88      1
1          2    15647311      Hill  ...               1       112542.58      0
2          3    15619304      Onio  ...               0       113931.57      1
3          4    15701354      Boni  ...               0        93826.63      0
4          5    15737888  Mitchell  ...               1        79084.10      0

[5 rows x 14 columns]

In [46]:
df.drop('CustomerId',axis='columns',inplace=True)

In [47]:
df.head()

   RowNumber   Surname  CreditScore  ... IsActiveMember EstimatedSalary  Exited
0          1  Hargrave          619  ...              1       101348.88       1
1          2      Hill          608  ...              1       112542.58       0
2          3      Onio          502  ...              0       113931.57       1
3          4      Boni          699  ...              0        93826.63       0
4          5  Mitchell          850  ...              1        79084.10       0

[5 rows x 13 columns]

In [48]:
df.drop('RowNumber',axis='columns',inplace=True)

In [49]:
df.head()

    Surname  CreditScore Geography  ... IsActiveMember  EstimatedSalary  Exited
0  Hargrave          619    France  ...              1        101348.88       1
1      Hill          608     Spain  ...              1        112542.58       0
2      Onio          502    France  ...              0        113931.57       1
3      Boni          699    France  ...              0         93826.63       0
4  Mitchell          850     Spain  ...              1         79084.10       0

[5 rows x 12 columns]

In [50]:
df.dtypes

Surname             object
CreditScore          int64
Geography           object
Gender              object
Age                  int64
Tenure               int64
Balance            float64
NumOfProducts        int64
HasCrCard            int64
IsActiveMember       int64
EstimatedSalary    float64
Exited               int64
dtype: object

In [ ]:
df[pd.to_numeric(df.Surname,errors='coerce').isnull()]

In [67]:
def print_unique_col_values(df):
       for column in df:
            if df[column].dtypes=='object':
                print(f'{column}: {df[column].unique()}')

In [68]:
print_unique_col_values(df)

Surname: ['Hargrave' 'Hill' 'Onio' ... 'Kashiwagi' 'Aldridge' 'Burbidge']
Geography: ['France' 'Spain' 'Germany']
Gender: ['Female' 'Male']

In [58]:
df[df.Surname!=' '].shape

(10000, 12)

In [64]:
df1 = df[df.Surname!=' ']
df1.Surname.dtype

dtype('O')

In [60]:
df1.dtypes

Surname             object
CreditScore          int64
Geography           object
Gender              object
Age                  int64
Tenure               int64
Balance            float64
NumOfProducts        int64
HasCrCard            int64
IsActiveMember       int64
EstimatedSalary    float64
Exited               int64
dtype: object

In [62]:
df1.Surname.unique()

array(['Hargrave', 'Hill', 'Onio', ..., 'Kashiwagi', 'Aldridge',
       'Burbidge'], dtype=object)